# Создаем начальный словарь товаров и цен
store = {'яблоко': 15, 'банан': 20, 'апельсин': 30}
print("Начальный список товаров и цен:", store)

# Добавляем новый товар "груша" по цене 25
store['груша'] = 25
print("Добавили грушу:", store)

# Удаляем товар "банан"
del store['банан']
print("Удалили банан:", store)

# Изменяем цену на яблоки на 20
store['яблоко'] = 20
print("Обновили цену на яблоки:", store)

# Рассчитываем стоимость покупки
count_apple = 2
count_orange = 3
total = (count_apple * store['яблоко']) + (count_orange * store['апельсин'])
print("Общая стоимость покупки:", total)
